# *Investigate Device or Account Across All MDE Tables At Once*

## Query Information

This query returns all Defender for Endpoint (MDE) related events for a target device or account.

##

#### Description

Disclaimer: Similar to Day 41 query, this is more of an "investigation" query and/or a query you would most likely run when you're investigating an incident in an environment where Defender for Endpoint (MDE) was deployed beforehand.

This query returns all Defender for Endpoint (MDE) related events for a target device (DeviceName) or account (AccountDomain, AccountName).

When investigating incidents through Defender for Endpoint (MDE), at some point, you'll want to get a "bird's eye view" of everything. With the two (2) most common scenarios (which are included in this page), in my opinion, being:

- Every event that occured on an endpoint
- Every event involving a user of interest

Luckily for us, this is what exactly what the KQL "union" operator allows us to do. We can "unite" all the MDE-related tables in a single query, and then use one (common) or multiple (depend on the tables) denominator to capture all the events that interest us. The MDE-related tables of interest here are:

- DeviceEvents
- DeviceFileEvents
- DeviceImageLoadEvents
- DeviceLogonEvents
- DeviceProcessEvents
- DeviceRegistryEvents

Querying all these tables at once can easily return a number of events superior to the limit of the console you're using. For instance, over 30,000 events in Microsoft Sentinel. Therefore, depending on what filters you are using, what time period you are covering, the size of the environment and the number of events generated by each onboarded system, you may be forced to:

- Target a specific time range
- Do a pre-filtering by using "distinct" on certain interesting columns, depending on what you're looking for before fine-tuning your query and running it again

In regard to the 2nd point, let's say you're looking for any event involving UserA as the AccountName or InitiatingProcessAccountName and over 30,000+ results are returned. You may want to finish your initial query by doing a simple "| distinct DeviceName" to see which devices that account has been observed on. And from there, run that query a single time for each device. Everyone has their way of doing things and there's no wrong answer here. Just do whatever works best for you, as long as it works obviously.

#### Author <Optional>
- **Name:** SecurityAura
- **Github:** https://github.com/SecurityAura
- **Twitter:** https://x.com/SecurityAura
- **BlueSky:** https://bsky.app/profile/securityaura.bsky.social
- **Mastodon (InfoSec.Exchange):** https://infosec.exchange/@SecurityAura
- **LinkedIn:** Coming Soon!
- **Website:** https://medium.com/@securityaura

### Queries Overview ###

- Defender for Endpoint (MDE) - 2 queries

## Microsoft Defender XDR ##
### Microsoft Defender for Endpoint via Everything (search by DeviceName) ###
```KQL
// Modify the StartDate and EndDate based on your needs.
let StartDate = todate("2025-02-22");
let EndDate = todate("2025-02-23");
// Set the DeviceName you want to get events from
let TargetDevice = "TARGET_DEVICE_NAME";
union DeviceEvents, DeviceFileEvents, DeviceImageLoadEvents, DeviceLogonEvents, DeviceProcessEvents, DeviceRegistryEvents
| where TimeGenerated between ( StartDate .. EndDate )
| where DeviceName =~ TargetDevice
```
### Microsoft Defender for Endpoint via Everything (search by AccountName) ###
```KQL
// Modify the StartDate and EndDate based on your needs.
let StartDate = todate("2025-02-22");
let EndDate = todate("2025-02-23");
// Set the AccountName you want to get events for
let TargetAccount = "TARGET_ACCOUNT_NAME";
// Should you want to query a specific account whose name can resolve to a local account or domain account, add the AccountDomain in the mix
let TargetAccountDomain = "TARGET_ACCOUNT_DOMAIN";
union DeviceEvents, DeviceFileEvents, DeviceImageLoadEvents, DeviceLogonEvents, DeviceProcessEvents, DeviceRegistryEvents
| where TimeGenerated between ( StartDate .. EndDate )
| where AccountName =~ TargetAccount
    or InitiatingProcessAccountName =~ TargetAccount
// If you also need to target the AccountName by AccountDomain, use the following filter instead, and comment the two (2) lines above
//| where (AccountDomain =~ TargetAccountDomain and AccountName =~ TargetAccount)
//    or (InitiatingProcessAccountDomain =~ TargetAccountDomain and InitiatingProcessAccountName =~ TargetAccount)
```
## Microsoft Sentinel ##
### Microsoft Defender for Endpoint via Everything (search by DeviceName) ###
```KQL
// Modify the StartDate and EndDate based on your needs.
let StartDate = todate("2025-02-22");
let EndDate = todate("2025-02-23");
// Set the DeviceName you want to get events from
let TargetDevice = "TARGET_DEVICE_NAME";
union DeviceEvents, DeviceFileEvents, DeviceImageLoadEvents, DeviceLogonEvents, DeviceProcessEvents, DeviceRegistryEvents
| where TimeGenerated between ( StartDate .. EndDate )
| where DeviceName =~ TargetDevice
```
### Microsoft Defender for Endpoint via Everything (search by AccountName) ###
```KQL
// Modify the StartDate and EndDate based on your needs.
let StartDate = todate("2025-02-22");
let EndDate = todate("2025-02-23");
// Set the AccountName you want to get events for
let TargetAccount = "TARGET_ACCOUNT_NAME";
// Should you want to query a specific account whose name can resolve to a local account or domain account, add the AccountDomain in the mix
let TargetAccountDomain = "TARGET_ACCOUNT_DOMAIN";
union DeviceEvents, DeviceFileEvents, DeviceImageLoadEvents, DeviceLogonEvents, DeviceProcessEvents, DeviceRegistryEvents
| where TimeGenerated between ( StartDate .. EndDate )
| where AccountName =~ TargetAccount
    or InitiatingProcessAccountName =~ TargetAccount
// If you also need to target the AccountName by AccountDomain, use the following filter instead, and comment the two (2) lines above
//| where (AccountDomain =~ TargetAccountDomain and AccountName =~ TargetAccount)
//    or (InitiatingProcessAccountDomain =~ TargetAccountDomain and InitiatingProcessAccountName =~ TargetAccount)
```
