# *Network Event From rundll32.exe With Suspicious Entry Point*

## Query Information

This query return network events generated by a rundll32.exe instance launched with a suspicious entry point.

##

#### Description

This query return network events generated by a rundll32.exe instance executing a file using a suspicious entry point.

The (ab)use of rundll32.exe by malware and threat actors alike is well documented, such as Cobalt Strike (https://www.cobaltstrike.com/blog/why-is-rundll32-exe-connecting-to-the-internet). A lot of beacons and/or DLL payloads that are launched through rundll32.exe may use entry points that overlap with known/benign Windows calls in order to blend in. However, when you look at the actual DLL file that is called, you may find one that is totally different from the one that should be called with that entry point.

A lot of these entry points have been documented over the years. You can simple Google "rundll32 + $ANY_OF_THE_ENTRY_POINT_IN_THE_QUERY" and you're guaranteed to find reports about them.

The query below look for instances of rundll32.exe in the DeviceNetworkEvents table, since most of the time, we'll be looking at beacons/backdoors launch, where the ProcessCommandLine has a such entry point.

Technically, this query can be improved further by using a datatable which links known association of Windows DLLs and the expected entry point and from there use the set_has_element() function to check for negative matches (where the association is NOT present in the datatable). For now, I'll leave it as an exercise to the reader ;)

PS: Yes, I'll come back at some point and complete that exercise for you after a certain set of time.

#### Author <Optional>
- **Name:** SecurityAura
- **Github:** https://github.com/SecurityAura
- **Twitter:** https://x.com/SecurityAura
- **BlueSky:** https://bsky.app/profile/securityaura.bsky.social
- **Mastodon (InfoSec.Exchange):** https://infosec.exchange/@SecurityAura
- **LinkedIn:** Coming Soon!
- **Website:** https://medium.com/@securityaura

#### Reference(s)

- https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
- https://cloud.google.com/blog/topics/threat-intelligence/unc2596-cuba-ransomware/
- https://thedfirreport.com/2021/06/28/hancitor-continues-to-push-cobalt-strike/
- And so much more ... Google is your friend here!

### Queries Overview ###

- Microsoft Defender for Endpoint (MDE) - 1 query

## Defender XDR ##
### Microsoft Defender for Endpoint via DeviceNetworkEvents ###
```KQL
// You can add more entry points as they get documented in public reports, or even ones you come across privately.
let EntryPoints = dynamic([
    "AllocConsole",
    "CleanMyTracksByProcess",
    "DllMain",
    "DllRegisterServer",
    "OpenQueryWindow",
    "StartW",
    "TstSec",
    "VirtualAlloc",
]);
DeviceNetworkEvents
| where InitiatingProcessFileName =~ "rundll32.exe"
| where RemoteIPType == "Public"
| where InitiatingProcessCommandLine has_any (EntryPoints)
```
## Microsoft Sentinel ##
### Microsoft Defender for Endpoint via DeviceNetworkEvents ###
```KQL
// You can add more entry points as they get documented in public reports, or even ones you come across privately.
let EntryPoints = dynamic([
    "AllocConsole",
    "CleanMyTracksByProcess",
    "DllMain",
    "DllRegisterServer",
    "OpenQueryWindow",
    "StartW",
    "TstSec",
    "VirtualAlloc",
]);
DeviceNetworkEvents
| where InitiatingProcessFileName =~ "rundll32.exe"
| where RemoteIPType == "Public"
| where InitiatingProcessCommandLine has_any (EntryPoints)
```
